workstation/openfoam-master-tutorials/tutorials/incompressible/pimpleFoam/LES/wallMountedHump/setups.orig/common/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1; // 30.0;

deltaT          0.001;

writeControl    timeStep;

writeInterval   50; // 500;

purgeWrite      3;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// user-defined variables
tStartAvg       0.05; // 10;

functions
{
    #include "fieldAverage"
    #include "volFields"
    #include "wallFields"
    #include "columnAverage"
    #include "sampleDict"
}

// ************************************************************************* //
